-------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY Incidence\disease_incidence/logs/d
> escriptive_tables.log
  log type:  text
 opened on:  11 Sep 2024, 16:14:47

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata18\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata18\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY Incidence\disease_incidence
> /analysis/extra_ados"

. 
. **Use cleaned data from previous step
. import delimited "$projectdir/output/measures/measures_dataset.csv", clear
(10 vars, 9,070 obs)

. 
. set scheme plotplainblind

. 
. *Descriptive statistics======================================================================*/
. 
. rename interval_start interval_start_s

. gen interval_start = date(interval_start_s, "YMD") 

. format interval_start %td

. drop interval_start_s interval_end

. 
. **Month/Year of interval
. gen year_diag=year(interval_start)

. format year_diag %ty

. gen month_diag=month(interval_start)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tmMon-CCYY

. generate str16 mo_year_diagn_s = strofreal(mo_year_diagn,"%tmCCYY!mNN")

. lab var mo_year_diagn "Month/Year of Diagnosis"

. lab var mo_year_diagn_s "Month/Year of Diagnosis"

. 
. gen ratio_100000 = ratio*100000

. 
. gen measure_inc = 1 if substr(measure,-10,.) == "_incidence"
(3,886 missing values generated)

. recode measure_inc .=0
(3,886 changes made to measure_inc)

. gen measure_prev = 1 if substr(measure,-11,.) == "_prevalence"
(8,638 missing values generated)

. recode measure_prev .=0
(8,638 changes made to measure_prev)

. gen measure_imd = 1 if substr(measure,-4,.) == "_imd"
(7,342 missing values generated)

. recode measure_imd .=0
(7,342 changes made to measure_imd)

. gen measure_ethnicity = 1 if substr(measure,-10,.) == "_ethnicity"
(7,344 missing values generated)

. recode measure_ethnicity .=0
(7,344 changes made to measure_ethnicity)

. 
. gen measure_inc_any = 1 if measure_inc ==1 | measure_imd==1 | measure_ethnicity==1
(432 missing values generated)

. recode measure_inc_any .=0
(432 changes made to measure_inc_any)

. 
. gen diseases_ = substr(measure, 1, strlen(measure) - 10) if measure_inc==1
(3,886 missing values generated)

. replace diseases_ = substr(measure, 1, strlen(measure) - 11) if measure_prev==1
(432 real changes made)

. replace diseases_ = substr(measure, 1, strlen(measure) - 14) if measure_imd==1
(1,728 real changes made)

. replace diseases_ = substr(measure, 1, strlen(measure) - 20) if measure_ethnicity==1
(1,726 real changes made)

. gen disease = strproper(subinstr(diseases_, "_", " ",.)) 

. 
. *Generate incidence and prevalence by months across ages, sexes, IMD and ethnicity
. sort disease mo_year_diagn measure

. bys disease mo_year_diagn measure: egen numerator_all = sum(numerator)

. bys disease mo_year_diagn measure: egen denominator_all = sum(denominator)

. gen ratio_all = numerator_all/denominator_all

. gen ratio_all_100000 = ratio_all*100000

. 
. bys disease mo_year_diagn measure: egen numerator_male = sum(numerator) if sex=="male"
(6,262 missing values generated)

. bys disease mo_year_diagn measure: egen denominator_male = sum(denominator) if sex=="male"
(6,262 missing values generated)

. gen ratio_male = numerator_male/denominator_male
(6,262 missing values generated)

. gen ratio_male_100000 = ratio_male*100000
(6,262 missing values generated)

. sort disease mo_year_diagn measure_prev measure_inc_any ratio_male_100000 

. by disease mo_year_diagn measure_prev measure_inc_any (ratio_male_100000): replace ratio_male_1
> 00000 = ratio_male_100000[_n-1] if missing(ratio_male_100000)
(6262 real changes made)

. 
. bys disease mo_year_diagn measure: egen numerator_female = sum(numerator) if sex=="female"
(6,262 missing values generated)

. bys disease mo_year_diagn measure: egen denominator_female = sum(denominator) if sex=="female"
(6,262 missing values generated)

. gen ratio_female = numerator_female/denominator_female
(6,262 missing values generated)

. gen ratio_female_100000 = ratio_female*100000
(6,262 missing values generated)

. sort disease mo_year_diagn measure_prev measure_inc_any ratio_female_100000 

. by disease mo_year_diagn measure_prev measure_inc_any (ratio_female_100000): replace ratio_fema
> le_100000 = ratio_female_100000[_n-1] if missing(ratio_female_100000)
(6262 real changes made)

. 
. **DO the same for IMD and ethnicity, then add moving average
. 
. save "$projectdir/output/data/processed_nonstandardised.dta", replace
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY
    Incidence\disease_incidence/output/data/processed_nonstandardised.dta saved

. 
. *Export a CSV for import into ARIMA R file
. keep if measure_inc==1
(3,886 observations deleted)

. sort disease mo_year_diagn age sex

. bys measure interval_start: gen n=_n

. keep if n==1
(4,896 observations deleted)

. drop n

. 
. rename year_diag year

. rename ratio_all_100000 incidence

. replace sex = "All"
(288 real changes made)

. keep disease sex mo_year_diagn year numerator_all denominator_all incidence

. rename numerator_all numerator

. rename denominator_all denominator

. 
. save "$projectdir/output/data/arima_nonstandardised.dta", replace //change to remove _new when 
> ready
file C:\Users\k1754142\OneDrive\PhD Project\OpenSAFELY
    Incidence\disease_incidence/output/data/arima_nonstandardised.dta saved

. outsheet * using "$projectdir/output/data/arima_nonstandardised.csv" , comma replace //change t
> o remove _new when ready 

. 
end of do-file

. exit, clear
